# Постарайтесь использовать то, что мы прошли на уроке при решении этого ДЗ,
# вспомните про zip(), map(), lambda, посмотрите где лучше с ними, а где они излишни!

# Задание - 1
# Создайте функцию, принимающую на вход Имя, возраст и город проживания человека
# Функция должна возвращать строку вида "Василий, 21 год(а), проживает в городе Москва"

def userInfo(name, age, city):
    return f"{name}, {age} год(а), проживает в городе {city}"

name = "Петр"
age = 159
city = "Чикаго"

print(userInfo(name, age, city))

# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них
def maxNumber(number1, number2, number3):
    return max(number1,number2,number3)

print(maxNumber(145,209,33))
# Задание - 3
# Создайте функцию, принимающую неограниченное количество строковых аргументов,
# верните самую длинную строку из полученных аргументов

def maxLen(*args):
    return max(args, key=len)

print(maxLen("яблоко","апельсинка","тигр","лев"))