import math

__author__ = 'Укладников Андрей'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

x = int(input("Введите целое число:"))#583759 # для простоты я задал в лоб число, но правильно сделать через input, и в реальной задачи конечно надо валидировать ввод, как сделано в easy - cм. Задача-1
print("Ввели:",x)
s = str(x)
i = 0
maxDigit = int(s[0])
while i < len(s):
    if int(s[i]) > maxDigit:
        maxDigit = int(s[i])
    i += 1

print("max цифра:",maxDigit)

# Задача: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,
# и сообщаете об диапазоне допустимых. И просите ввести заного.
# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4

a = int(input("Введите число больше 0, но меньше 10:"))
while a <= 0 or a >= 10:
    a = int(input("Число должно быть больше 0 и меньше 10. Введите снова:"))
print(a ** 2)



# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

v1 = input("Введите первое значение")
v2 = input("Введите второе значение")
print("Ввели первое значение:",v1)
print("Ввели второе значение:",v2)
(v1,v2) = ((v1,v2)[1],(v1,v2)[0])
print("стало первое значение=",v1)
print("стало второе значение=",v2)



# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

# использование exception см. в easy - в реальной задачи конечно надо валидировать ввод, как сделано в easy - Задача-1
a = float(input("Введите к-т 'a':"))
while a == 0:
    a = float(input("Введите к-т 'a' != 0:"))

b = float(input("Введите к-т 'b':"))
c = float(input("Введите к-т 'c':"))
D = b ** 2 - 4 * a * c
while D < 0:
    c = float(input("Введите к-т 'c', чтобы b ** 2 - 4 * a * c было > 0:"))
    D = b ** 2 - 4 * a * c

tmp = -b + math.sqrt(D)
x1 = tmp / (2 * a)
tmp = -b - math.sqrt(D)
x2 = tmp / (2 * a)

print("x1=",x1)
print("x2=",x2)


