# Все задачи текущего блока решите с помощью генераторов списков!
def check1(item):
    condition1 = (item % 3 == 0)
    condition2 = item > 0
    condition3 = (item % 4 != 0)
    return condition1 and condition2 and condition3

# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

source = [1, 2, 4, 0, 8]
result = [x ** 2 for x in source]
print(result)

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

fruits1 = ["яблоко","апельсин","мандарин"]
fruits2 = ["ананас","грейпфрукт","апельсин","яблоко"]

commonFruits = [item for item in fruits2 if fruits1.count(item) > 0 ]
print(commonFruits)

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

source2 = [1, 2, 4, 7, 8, 3, 5, -9, 12]
result2 = [item for item in source2 if check1(item)]
print(result2)